# -*- coding: utf-8 -*-  # 声明文件编码为 UTF-8，确保代码中可以正常显示中文字符

# --- 视觉配置：定义 UI 界面的调色板 (HEX 颜色码) ---
COLORS = {
    "bg": "#050505",          # 主背景色：极深灰色，营造科幻底色
    "grid": "#003333",        # 背景网格线颜色：深青色，类似雷达扫描线
    "main": "#00ffcc",        # 主色调：高亮青色，用于主要的 UI 元素
    "accent": "#FF2D2D",      # 强调色：鲜红色，用于警告或关键提示
    "eva_red": "#FF2D2D",     # EVA 主题红色：模仿初号机处于暴走或警告状态的颜色
    "warning_bg": "#1A0505",  # 警告背景色：暗红色，用于弹出报警框的底层
    "dim": "#0F2A2A",         # 暗色修饰：用于非活跃状态的 UI 组件
    "sec_joy": "#FFD700",     # 次要摇杆颜色：金色
    "alert": "#FFD700",       # 警报色：金色/黄色，用于中等程度的提醒
    "text_log": "#00ff00"     # 日志文本色：纯绿色，模拟复古终端机显示
}

# --- 尺寸配置：定义 UI 布局和物理组件的大小 (单位通常为像素) ---
DIMS = {
    "width": 2400,            # 整个应用程序窗口的宽度
    "height": 1200,           # 整个应用程序窗口的高度
    "joy_size": 350,          # 摇杆控制区的总显示尺寸
    "joy_radius": 130,        # 摇杆底座的圆半径
    "knob_radius": 30,         # 摇杆中心控制点（操纵杆帽）的半径

    # === 左侧：控制面板区域 (Left Panel) ===
    "left_son2_width":1400,
    "left_son2_height":500,
    "decor_width": 270,  # 计算出的装饰面板宽度
    "dash_width": 120   # 仪表盘宽度
}

# --- 控制参数：定义机器人或设备的物理运动限制 ---
PARAMS = {
    "max_x_offset": 100,  # 定义 Y/H 轴逻辑上的最大偏移量（独立于 max_move）
    "max_move": 120,          # 最大移动步进值或逻辑位移上限
    
    # R (Roll) - 翻滚角控制（通常指设备绕 X 轴的左右倾斜）
    "r_min": -30.0,           # 翻滚角的最小值（左倾 30 度）
    "r_max": 30.0,            # 翻滚角的最大值（右倾 30 度）
    "r_step": 3.0,            # 每次调整翻滚角时的增量步长
    
    # H (Height) - 高度控制（通常指机身距离地面的高度）
    "h_default": 110.0,       # 默认起始高度（中位高度）
    "h_min": 83.0,            # 设备能降到的最低高度限制
    "h_max": 137.0,           # 设备能升到的最高高度限制
    "h_step": 2.7,            # 每次调整高度时的增量步长
    
    # 数据传输控制
    "send_interval": 0.15     # 指令发送频率：每 0.15 秒向设备发送一次控制包（约 6.6Hz）
}


# --- config.py：网络通信相关的基础配置 ---
TCP_CONFIG = {
    "default_ip": "192.168.10.110",  # 目标设备单片机的默认静态 IP 地址
    "default_port": 8080             # TCP 通信所使用的端口号

}

UDP_CONFIG = {
    "RK3506_ip":"192.168.10.114",
    "RK3506_sensor_port":8888,
    "RK3506_UDP_port":9999
}